# -*- encoding: utf-8 -*-
"""
--------------------------------------------------------
@File: utils.py
@Project: dnf-pfv-manager 
@Time: 2024/11/15   05:24
@Author: shelhen
@Email: shelhen@163.com
@Software: PyCharm 
--------------------------------------------------------
# @Brief:
"""

equip_map = {
    'title name': '称号',
    'weapon': "武器",
    'ring': "戒指",
    'wrist': '手镯',
    'magic stone': "魔法石",
    'amulet': '项链',
    'creature': "宠物装备",
    'support': '辅助装备',
    'shoulder': "头肩",
    'waist': "腰带",
    'coat': "上衣",
    'pants': '下装',
    'shoes': "鞋",
    'artifact': "未知",
    'artifact green': "绿色",
    'artifact blue': "蓝色",
    'artifact red': "红色",

    'skin avatar': "皮肤",
    'waist avatar': "腰部",
    'face avatar': "面部",
    'breast avatar': "肩部",
    'hair avatar': "发部",
    'aurora avatar': "光环",
    'hat avatar': "头部",
    'shoes avatar': "足部",
    'pants avatar': "下身",
    'coat avatar': "上身"
}
trade_map = {
    '[trade]': "无法交易",
    '[sealing]': "已解封",
    '[free]': "可交易",
    '[account]': "账号绑定",
    '[trade delete]': "活动"
}
rarity_map = {-1: '未知', 0: '普通', 1: '高级', 2: '稀有', 3: '神器', 4: '史诗', 5: '勇者', 6: '传说', 7: '神话'}
job_map = {
    '[all]': "全部职业",
    '[swordman]': '鬼剑士',
    '[fighter]': '格斗家',
    '[gunner]': '神枪手',
    '[mage]': '魔法师',
    "[mage\r\n": '魔法师',
    '[priest]': '圣职者',
    '[at gunner]': '女神枪手',
    '[thief]': '暗夜使者',
    '[at fighter]': '女格斗家',
    '[at mage]': '男魔法师',
    '[demonic swordman]': '魔枪士',
    '[creator mage]': '女鬼剑士'
}
equipment_map = {
    '武器': {
        '鬼剑士': {0: '短剑', 1: '太刀', 2: '巨剑', 3: '钝器', 5: '光剑'},
        '魔枪士': {0: "长枪", 1: "战戟", 2: "光枪", 3: "长矛", -1: "全部"},
        '格斗家': {0: '手套', 1: '臂铠', 2: '爪', 3: '拳套', 5: '东方棍'},
        '神枪手': {0: '左轮', 1: '自动手枪', 2: '步枪', 3: '手炮', 4: '手弩'},
        '魔法师': {0: '矛', 1: '棍棒', 2: '魔杖', 3: '法杖', 4: '扫把'},
        '圣职者': {0: '十字架', 1: '念珠', 2: '图腾', 3: '镰刀', 4: '战斧'},
        '暗夜使者': {0: '匕首', 1: '双剑', 2: '手杖'}
    },
    "防具": {0: '布甲', 1: '皮甲', 2: "轻甲", 3: '重甲', 4: '板甲'},
    '首饰': ['项链', '手镯', '戒指'],
    '特殊装备': ['辅助装备', '魔法石', '称号'],
    '其它': ['其它', ]
}
string_map = {
    'HP': 'HP', 'MP': 'MP', 'physical': '物理', 'defense': '防御', 'magical': '魔法', 'attack': '攻击',
    'water': '水(冰)属性', 'resistance': '抗性', 'regen': '恢复', 'MAX': '最大值',
    'speed': '速度', 'skill': '技能', 'level': '等级', 'up': '上升', 'separate': '独立', 'rate': '比率', 'move': '移动',
    'hit recovery': '硬直', 'jump': '跳跃', 'power': '抛瓦', 'inventory': '物品',
    'limit': '上限', 'fire': '火属性', 'stuck': '命中', 'elemental': '元素', 'property': '属性', 'critical hit': '暴击',
    'all': '全', 'stone': '石化', 'dark': '暗属性', 'light': '光属性',
    'hold': '束缚', 'slow': '减速', 'equipment': '装备', 'rigidity': '僵直', 'poison': '毒', 'activestatus': '异常状态',
    'room': '房间', 'list': '列表', 'cast': '吟唱', 'element': '元素'
}
type_map = {
    '短剑': 'ssword', '太刀': 'katana', '巨剑': 'hsword', '钝器': 'club', '光剑': 'beamsword',
    '手套': 'knuckle', '臂铠': 'gauntlet', '爪': 'claw', '拳套': 'boxglove', '东方棍': 'tonfa',
    '自动手枪': 'automatic', '手弩': 'bowgun', '左轮': 'revolver', '步枪': 'musket', '手炮': 'hcannon',
    '法杖': 'staff', '魔杖': 'rod', '棍棒': 'pole', '矛': 'spear', '扫把': 'broom',
    '十字架': 'cross', '镰刀': 'scythe', '念珠': 'rosary', '图腾': 'totem', '战斧': 'axe',
    '手杖': 'wand', '匕首': 'dagger', '双剑': 'twinsword', '项链': 'amulet', '手镯': 'wrist',
    '戒指': 'ring', '辅助装备': 'support', '魔法石': 'magicstone', '称号': 'title',
    '上衣': 'jacket', '头肩': 'shoulder', '下装': 'pants', '腰带': 'belt', '鞋': 'shoes',
    '布甲': 'cloth', '皮甲': 'leather', '轻甲': 'larmor', '重甲': 'harmor', '板甲': 'plate',
    '鬼剑士': 'swordman', '格斗家': 'fighter', '神枪手': 'gunner', '魔法师': 'mage', '圣职者': 'priest',
    '暗夜使者': 'thief'
}
supply_map = {
    'waste': [2, '消耗品'],
    'recipe': [2, '制作图'],
    'material expert job': [10, '副职业'],
    'enchant waste': [5, '宝珠'],
    'avatar emblem': [6, '徽章'],
    'feed': [7, '宠物饲料'],
    'etc': [8, 'etc'],
    'creature': [7, '宠物消耗品'],
    'booster': [11, '礼包1'],
    'material': [3, '材料'],
    'quest': [4, '任务材料'],
    'throw': [2, '投掷品'],
    'upgradable legacy': [2, '礼包2'],
    'disguise': [2, '变装道具'],
    'disguise random': [2, '变装道具2'],
    'only effect': [2, '城镇特效'],
    'booster selection': [11, '礼包3'],
    'usable cera package': [11, '时装礼包'],
    'dye': [2, '染色剂'],
    'set': [2, '陷阱'],
    'cera booster': [11, '其它礼包1'],
    'cera package': [11, '其它礼包2'],
    'unlimited waste': [2, '无限道具'],
    'expert town potion': [2, '城镇药剂'],
    'quest receive': [9, '悬赏令'],
    'legacy': [13, '旧物品'],
    'stackable legacy': [13, '旧物品2'],
    'global effect': [2, '全局光环'],
    'booster random': [11, '随机礼包'],
    'upgrade limit cube': [2, '升级盒子'],
    'multi upgradable legacy': [11, '礼包4'],
    'creature expitem': [7, '宠物经验道具'],
    'teleport potion': [2, '传送药剂'],
    'town and dungeon': [2, '城镇/副本道具'],
    'unlimited town and dungeon': [2, '无限城镇/副本道具'],
    'contract': [12, '契约'],
    'multi upgradable legacy bonus cera': [11, '多重奖励包'],
}

# [auto use special buff]

formatedTypeMap = {
    1: '装备',
    2: '消耗品',
    3: '材料',
    10: '副职业',
    4: '任务材料',
    5: '宝珠',
    6: '时装徽章',
    7: '宠物消耗品',
    8: 'etc',
    9: '悬赏令',
    13: '旧物品',
    11: '礼包',
    12: '契约'
}
magicmap = {
    1: '失明', 2: '冰冻', 3: '眩晕', 4: '睡眠', 5: '束缚', 6: '混乱', 7: '石化', 8: '中毒', 9: '出血',
    10: '感电', 11: '灼伤', 12: '减速', 13: '诅咒', 14: '祝福', 15: '武力', 16: '智慧', 17: '活力', 18: '冥想',
    19: '血气', 20: '灵气', 21: '集中', 22: '敏捷', 25: '鹰眼', 26: '鹰眼', 27: '灵心', 28: '梅花鹿',
    29: '丹顶鹤', 30: '南非狮', 31: '北极狐', 32: '灰棕熊', 33: '草原狼', 34: '赤腹鹰', 35: '黑蝙蝠',
    36: '东北虎', 37: '猫头鹰', 38: '大黄蜂', 39: '眼镜蛇', 40: '美洲豹', 41: '迅击', 42: '吟唱', 43: '灵活',
    44: '祈祷', 45: '狩猎', 46: '追猎', 47: '园丁', 48: '木匠', 49: '虎纹蛙', 50: '狼蛛', 51: '惩戒',
    52: '天罚', 53: '驱魔', 54: '破魔', 55: '神使', 56: '圣徒', 57: '猎龙', 58: '屠龙', 60: '迅捷',
    61: '破武器', 62: '破甲', 63: '驱散', 64: '强击', 65: '毁伤', 66: '致命', 67: '猛击', 70: '武力',
    71: '智慧', 72: '活力', 73: '冥想', 74: '血气', 75: '灵气', 76: '集中', 77: '敏捷', 80: '鹰眼', 81: '灵心',
    82: '梅花鹿', 83: '丹顶鹤', 84: '巨海龟', 85: '灰棕熊', 86: '草原狼', 87: '赤腹鹰', 88: '黑蝙蝠',
    89: '东北虎', 90: '猫头鹰', 96: '集中', 97: '敏捷', 100: '武力', 101: '智慧', 102: '活力', 103: '冥想',
    104: '血气', 105: '灵气', 106: '鹰眼', 107: '灵心', 108: '梅花鹿', 109: '丹顶鹤', 110: '暹罗猫',
    111: '灰棕熊', 112: '草原狼', 113: '赤腹鹰', 114: '黑蝙蝠', 115: '东北虎', 116: '猫头鹰', 117: '烈焰',
    118: '寒冰', 119: '圣光', 120: '黑暗', 130: '迅击', 131: '吟唱', 132: '灵活', 133: '祈祷', 134: '抵御',
    140: '武力', 141: '智慧', 142: '活力', 143: '冥想', 144: '血气', 145: '灵气', 150: '鹰眼', 151: '灵心',
    152: '集中', 153: '敏捷', 185: '格斗家', 186: '格斗家', 187: '格斗家', 188: '魔法师', 189: '魔法师',
    190: '魔法师', 191: '魔法师', 192: '神枪手', 193: '神枪手', 194: '神枪手', 195: '圣职者', 196: '圣职者',
    197: '暗夜使者', 198: '暗夜使者', 199: '暗夜使者', 240: '火属性增幅', 241: '冰属性增幅', 242: '暗属性增幅',
    243: '光属性增幅', 244: '火', 245: '冰', 246: '暗', 247: '光', 248: '过去', 249: '现在', 250: '未来',
    251: '永焱'
}